{
  "backend/main.mo": "Motoko actor managing categories, writings, and user profiles with admin/user authorization checks.",
  "feature_evidence.json": "Feature evidence report listing branding update features, affected files, components, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-style map summarizing all major frontend files and their roles in routing, UI, and admin features.",
  "frontend/index.css": "Tailwind base styles defining custom OKLCH color variables and theme settings for light and dark modes.",
  "frontend/index.html": "Base HTML document setting the root mount point and site title \"Meri KITAAB\".",
  "frontend/src/App.tsx": "Main React router configuration defining public and admin routes wrapped in site and admin layouts.",
  "frontend/src/components/admin/WritingPreview.tsx": "Admin preview card rendering writing title, warnings, and formatted content using prose styles.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen showing authentication or admin-access errors with login and return-home actions.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard that checks Internet Identity authentication and admin permissions before rendering children.",
  "frontend/src/components/auth/LoginButton.tsx": "Auth button handling Internet Identity login/logout with query cache clearing on sign-out.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal that collects a user's name and saves the profile using a mutation with basic validation and toast feedback.",
  "frontend/src/components/layout/AdminLayout.tsx": "Admin dashboard layout providing navigation to categories and writings along with a back-to-site button.",
  "frontend/src/components/layout/SiteLayout.tsx": "Main site layout with header, navigation, authentication/UI hooks, optional admin link, and footer.",
  "frontend/src/components/state/ErrorState.tsx": "Displays a styled error message with optional retry button and friendly error text mapping.",
  "frontend/src/components/state/LoadingState.tsx": "Shows a loading message and a configurable number of skeleton placeholders.",
  "frontend/src/hooks/queryKeys.ts": "Defines reusable React Query keys for categories, writings, profiles, and admin checks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identities, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for public, admin, and mutation operations interacting with the backend actor.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark color palettes and typography enhancements.",
  "frontend/src/main.tsx": "Application entry point initializing React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Admin interface for listing, editing, and deleting categories with status badges and confirmation dialogs. Supports navigation and error/loading handling.",
  "frontend/src/pages/admin/AdminCategoryEditorPage.tsx": "Form for creating or editing a category with fields for title, status, and banner URL. Saves changes via API hooks and handles validation and loading states.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing counts of categories and writings with quick navigation to management pages. Provides shortcuts to create new items.",
  "frontend/src/pages/admin/AdminWritingEditorPage.tsx": "Provides a form-based editor to create or update writings with title, content, category, and warnings, including preview and save logic. Integrates API mutations and navigation with loading and validation handling.",
  "frontend/src/pages/admin/AdminWritingsPage.tsx": "Lists all writings with options to create, edit, publish, unpublish, and delete. Handles loading/error states and user actions with confirmation dialogs and API mutations.",
  "frontend/src/pages/CategoryPage.tsx": "Displays a specific category and its published writings, handling loading, errors, and navigation to writing details. Filters writings by category and updates the page title.",
  "frontend/src/pages/HomePage.tsx": "Shows the homepage with a hero section, public categories, and recent writings. Handles loading and error states for category data.",
  "frontend/src/pages/WritingDetailPage.tsx": "Renders a full writing with category info, content warnings, and navigation back to category or home. Handles loading, errors, and dynamic page titles.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL or hash. Supports both query-string and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, fonts, animations, and plugins like typography and container queries.",
  "project_state.json": "Metadata file describing project state, features, pending requests, and high-level project info for Meri KITAAB."
}