{
  "backend/main.mo": "Defines categories, writings, and user profiles with authorization‑protected CRUD operations and profile access.",
  "feature_evidence.json": "Lists implemented features with associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides short descriptions of all major frontend files for reference and build planning.",
  "frontend/index.css": "Global Tailwind styles with warm color tokens, dark mode variables, and base layout rules.",
  "frontend/index.html": "Basic HTML shell loading the React application root and main script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for public and admin pages with layouts and admin guards.",
  "frontend/src/components/admin/WritingPreview.tsx": "Admin preview component rendering writing title, metadata, and styled content.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays access‑denied messaging with login and navigation options based on auth state.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Protects admin routes by checking Internet Identity login and admin status before rendering children.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a sign-in/sign-out button using Internet Identity and clears queries on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting users to enter and save their name during profile setup.",
  "frontend/src/components/layout/AdminLayout.tsx": "Admin dashboard layout with navigation to categories and writings.",
  "frontend/src/components/layout/SiteLayout.tsx": "Main site layout with header, footer, navigation, login, and optional admin access.",
  "frontend/src/components/state/ErrorState.tsx": "Displays an error message with optional retry button.",
  "frontend/src/components/state/LoadingState.tsx": "Shows a loading message and skeleton placeholders.",
  "frontend/src/hooks/queryKeys.ts": "Defines stable query keys for React Query operations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated/anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login handling, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating categories, writings, user profile, and admin data.",
  "frontend/src/index.css": "Tailwind-based global styles with custom warm color palette and typography rules.",
  "frontend/src/main.tsx": "Application entry point initializing React, QueryClient, and Internet Identity provider.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Admin view listing all categories with options to create, edit, delete, and view status.",
  "frontend/src/pages/admin/AdminCategoryEditorPage.tsx": "Form page for creating or editing a category, handling loading, submission, and validation.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing counts of categories and writings with quick navigation to management pages.",
  "frontend/src/pages/admin/AdminWritingEditorPage.tsx": "Provides a form-driven page for creating or editing writings, handling loading, validation, preview, and submission via admin queries.",
  "frontend/src/pages/admin/AdminWritingsPage.tsx": "Displays a list of all admin writings with actions to publish, unpublish, edit, or delete, including loading and error states.",
  "frontend/src/pages/CategoryPage.tsx": "Displays a category with its filtered published writings, handling loading, errors, and navigation to each writing.",
  "frontend/src/pages/HomePage.tsx": "Shows the homepage with a hero section, public categories, and recent writings, with loading and error handling.",
  "frontend/src/pages/WritingDetailPage.tsx": "Renders a single writing with its category and warnings, providing navigation back and full content display.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, colors, typography, plugins, and container settings.",
  "project_state.json": "Project metadata describing features, requirements, architecture notes, issues, and image assets for the writing website."
}